{
    "name": "Flexitol Heel Balm",
    "brand": "Flexitol",
    "description": "An exfoliating, moisturizing heel balm designed to soften and renew dry, cracked skin on feet, ideal for pedicures.",
    "longDescription": "Flexitol Moisturizing Exfoliating Pedicures is an effective treatment designed to transform rough, cracked heels and dry feet into smoother, more supple skin. Formulated with potent exfoliating ingredients and rich moisturizers, this 8 oz heel balm gently removes dead skin cells while deeply hydrating, leaving your feet revitalized. Its non-greasy formula is perfect for regular use during pedicures and everyday foot care, providing lasting softness and comfort. Enjoy the benefits of smoother, healthier feet with Flexitol’s trusted care.",
    "price": "$7.49",
    "amazonUrl": "https://www.amazon.com/Flexitol-Moisturizing-Exfoliating-Pedicures-Effective/dp/B077SFYFL8/",
    "videoId": "",
    "features": [
      {
        "title": "Intensive Moisturization",
        "description": "Deeply hydrates and softens dry, cracked heels for renewed skin texture.",
        "icon": "star"
      },
      {
        "title": "Exfoliating Action",
        "description": "Gently removes dead skin cells to reveal smoother, healthier feet.",
        "icon": "star"
      },
      {
        "title": "Non-Greasy Formula",
        "description": "Lightweight and fast-absorbing for comfortable, everyday use.",
        "icon": "star"
      },
      {
        "title": "Ideal for Pedicures",
        "description": "Enhances pedicure treatments with effective, visible results.",
        "icon": "star"
      }
    ],
    "pros": [
      "Effectively hydrates and exfoliates dry, cracked skin.",
      "Improves overall foot appearance with regular use.",
      "Non-greasy and fast-absorbing formula.",
      "Suitable for regular pedicures and daily foot care."
    ],
    "cons": [
      "Results may vary depending on skin condition.",
      "Some users may require more frequent application.",
      "Not ideal for those preferring scented products."
    ]
  }
  