{
    "name": "Dr. Jill's Latex-Free Cushion for Plantar Fasciitis, Regular Fit, 4 pk",
    "brand": "Dr. Jill's",
    "description": "A set of four latex-free cushions designed to relieve plantar fasciitis discomfort, providing targeted cushioning and support for everyday comfort.",
    "longDescription": "Dr. Jill's Latex-Free Cushion for Plantar Fasciitis offers a specialized solution for relieving foot pain associated with plantar fasciitis. This regular fit, 4-pack cushion set is crafted without latex, making it ideal for those with sensitive skin. Its ergonomic design contours to your foot, delivering targeted support where you need it most. Perfect for use in your favorite shoes or at home, these cushions help reduce pressure and alleviate discomfort, enhancing overall foot health. Experience improved comfort and relief with this doctor-recommended, innovative cushioning solution.",
    "price": "$19.99",
    "amazonUrl": "https://www.amazon.com/Dr-Jills-Latex-Free-Cushion-Regular-4/dp/B09RNGNT42/",
    "videoId": "",
    "features": [
      {
        "title": "Latex-Free Comfort",
        "description": "Designed without latex for a gentle, hypoallergenic cushioning experience.",
        "icon": "star"
      },
      {
        "title": "Targeted Support",
        "description": "Provides focused cushioning to relieve pressure on affected areas.",
        "icon": "star"
      },
      {
        "title": "Ergonomic Design",
        "description": "Contours naturally to your foot, enhancing support and comfort.",
        "icon": "star"
      },
      {
        "title": "Durable & Reusable",
        "description": "Built to last and easy to clean, offering long-term value.",
        "icon": "star"
      }
    ],
    "pros": [
      "Effective plantar fasciitis relief",
      "Latex-free, suitable for sensitive skin",
      "Ergonomic design for targeted cushioning",
      "Set of 4 provides excellent value"
    ],
    "cons": [
      "May not fit all shoe types",
      "Cushions might feel firm for some users",
      "Results can vary based on individual needs"
    ]
  }
  