{
    "name": "Dr. Jill's Latex-Free Gel Cushion for Ball of Foot",
    "slug": "dr-jills-latex-free-gel-cushion-for-ball-of-foot",
    "brand": "Dr. Jill's",
    "description": "A set of four latex-free cushions designed to relieve plantar fasciitis discomfort with targeted cushioning and support for everyday use.",
    "longDescription": "Dr. Jill's Latex-Free Cushion for Plantar Fasciitis is engineered to provide effective relief for foot pain caused by plantar fasciitis. This regular fit, 4-pack cushion set is crafted without latex, making it ideal for sensitive skin. Its ergonomic design contours to your foot to deliver targeted support exactly where it's needed. Whether used at home or in your favorite shoes, these cushions help reduce pressure and improve overall foot comfort. Recommended by professionals, they offer a practical solution for long-lasting plantar fasciitis relief.",
    "price": "$19.99",
    "amazonUrl": "https://www.amazon.com/Dr-Jills-Latex-Free-Cushion-Regular-4/dp/B09RNGNT42/",
    "videoId": "",
    "features": [
      {
        "title": "Latex-Free Comfort",
        "description": "Formulated without latex for a gentle, hypoallergenic cushioning experience.",
        "icon": "star"
      },
      {
        "title": "Targeted Support",
        "description": "Delivers focused cushioning to alleviate pressure on key areas of the foot.",
        "icon": "star"
      },
      {
        "title": "Ergonomic Design",
        "description": "Contours naturally to the foot for enhanced support and comfort.",
        "icon": "star"
      },
      {
        "title": "Durable & Reusable",
        "description": "Built to last with high-quality materials and easy to clean for repeated use.",
        "icon": "star"
      }
    ],
    "pros": [
      "Provides effective relief for plantar fasciitis",
      "Latex-free formulation suitable for sensitive skin",
      "Ergonomic design offers targeted cushioning",
      "Pack of 4 delivers excellent value"
    ],
    "cons": [
      "May not fit perfectly in every shoe style",
      "Cushions could feel firm to some users",
      "Individual results may vary"
    ]
  }
  